<%

Select Case GetCampusVarsSiteMGC("_CAMPUS_CODE_")
    Case "CD0249": meta_keywords = "러셀학원, 러셀 입시학원, 러셀학원, 러셀CORE학원, 러셀 기숙학원, 입시전문학원, 수능자습학원, 수능대비학원, 최상위권입시전략, 의대입시전략, 메가스터디러셀윈터스쿨, 러셀윈터스쿨, 윈터스쿨, 겨울방학, 최상위권겨울방학, 최상위권윈터스쿨, 고1입시준비, 겨울방학학원, 겨울방학공부, 고1수능, 고등학생겨울방학학원, 겨울방학수능준비, 공부습관, 학습습관, 학습습관형성, 겨울방학학습습관형성, 윈터스쿨후기, 러셀윈터스쿨후기, 영통윈터스쿨, 영통러셀윈터스쿨, 영통윈터스쿨후기, 러셀영통, 영통러셀, 고2겨울방학, 고2입시준비, 2028학년도수능준비, 러셀재수종합반, 영통재수종합반, 러셀영통재수종합반, 윈터스쿨재수종합반, 영통윈터스쿨재수종합반"
                    meta_description = "Win을 만드는 겨울, 압도적 성장! 러셀 영통 재수종합반에서 최상위권으로 당당하게 도약하세요."

	Case "CD0342": meta_keywords = "러셀학원, 러셀 입시학원, 러셀학원, 러셀CORE학원, 러셀 기숙학원, 입시전문학원, 수능자습학원, 수능대비학원, 최상위권입시전략, 의대입시전략, 메가스터디러셀윈터스쿨, 러셀윈터스쿨, 윈터스쿨, 겨울방학, 최상위권겨울방학, 최상위권윈터스쿨, 고1입시준비, 겨울방학학원, 겨울방학공부, 고1수능, 고등학생겨울방학학원, 겨울방학수능준비, 공부습관, 학습습관, 학습습관형성, 겨울방학학습습관형성, 윈터스쿨후기, 러셀윈터스쿨후기, 대구윈터스쿨, 대구러셀윈터스쿨, 대구윈터스쿨후기, 러셀대구, 대구러셀, 고2겨울방학, 고2입시준비, 2028학년도수능준비, 러셀재수종합반, 대구재수종합반, 러셀대구재수종합반, 윈터스쿨재수종합반, 대구윈터스쿨재수종합반"
                    meta_description = "Win을 만드는 겨울, 터지는 잠재력! 최상위권으로 도약하는 학습 습관을 러셀 대구 재수종합반에서 완성하세요."

	Case "CD0349": meta_keywords = "러셀학원, 러셀 입시학원, 러셀학원, 러셀CORE학원, 러셀 기숙학원, 입시전문학원, 수능자습학원, 수능대비학원, 최상위권입시전략, 의대입시전략, 메가스터디러셀윈터스쿨, 러셀윈터스쿨, 윈터스쿨, 겨울방학, 최상위권겨울방학, 최상위권윈터스쿨, 고1입시준비, 겨울방학학원, 겨울방학공부, 고1수능, 고등학생겨울방학학원, 겨울방학수능준비, 공부습관, 학습습관, 학습습관형성, 겨울방학학습습관형성, 윈터스쿨후기, 러셀윈터스쿨후기, 울산윈터스쿨, 울산러셀윈터스쿨, 울산윈터스쿨후기, 러셀울산, 울산러셀, 고2겨울방학, 고2입시준비, 2028학년도수능준비, 러셀재수종합반, 울산재수종합반, 러셀울산재수종합반, 윈터스쿨재수종합반, 울산윈터스쿨재수종합반"
                    meta_description = "Win을 만드는 겨울, 터지는 잠재력! 최상위권으로 도약하는 학습 습관을 러셀 울산 재수종합반에서 완성하세요."

	Case "CD0340": meta_keywords = "러셀학원, 러셀 입시학원, 러셀학원, 러셀CORE학원, 러셀 기숙학원, 입시전문학원, 수능자습학원, 수능대비학원, 최상위권입시전략, 의대입시전략, 메가스터디러셀윈터스쿨, 러셀윈터스쿨, 윈터스쿨, 겨울방학, 최상위권겨울방학, 최상위권윈터스쿨, 고1입시준비, 겨울방학학원, 겨울방학공부, 고1수능, 고등학생겨울방학학원, 겨울방학수능준비, 공부습관, 학습습관, 학습습관형성, 겨울방학학습습관형성, 윈터스쿨후기, 러셀윈터스쿨후기, 광주윈터스쿨, 광주러셀윈터스쿨, 광주윈터스쿨후기, 러셀CORE광주, 광주러셀, 고2겨울방학, 고2입시준비, 2028학년도수능준비, 러셀재수종합반, 광주재수종합반, 러셀CORE광주재수종합반, 윈터스쿨재수종합반, 광주윈터스쿨재수종합반"
                    meta_description = "Win을 만드는 겨울, 터지는 잠재력! 최상위권으로 도약하는 학습 습관을 러셀CORE 광주 재수종합반에서 완성하세요."

End Select
%>

<meta name="title" content="2026 윈터스쿨종합반" />
<meta name="keywords" content="<%=meta_keywords%>" />
<meta name="description" content="<%=meta_description%>" />
<meta property="og:type" content="website">
<meta property="og:title" content="2026 윈터스쿨종합반">
<meta property="og:description" content="<%=meta_description%>"/>