<%
    function getBarcode(mem_cd)
        ' barcode CODE-128C
        ' 짝수 갯수인 숫자만 사용 가능합니다.
        dim ii, bar, checksum, a(106), tot, seq, result
        bar = mem_cd

        a(0) =  "11011001100"
        a(1) =  "11001101100"
        a(2) =  "11001100110"
        a(3) =  "10010011000"
        a(4) =  "10010001100"
        a(5) =  "10001001100"
        a(6) =  "10011001000"
        a(7) =  "10011000100"
        a(8) =  "10001100100"
        a(9) =  "11001001000"
        a(10) =  "11001000100"
        a(11) =  "11000100100"
        a(12) =  "10110011100"
        a(13) =  "10011011100"
        a(14) =  "10011001110"
        a(15) =  "10111001100"
        a(16) =  "10011101100"
        a(17) =  "10011100110"
        a(18) =  "11001110010"
        a(19) =  "11001011100"
        a(20) =  "11001001110"
        a(21) =  "11011100100"
        a(22) =  "11001110100"
        a(23) =  "11101101110"
        a(24) =  "11101001100"
        a(25) =  "11100101100"
        a(26) =  "11100100110"
        a(27) =  "11101100100"
        a(28) =  "11100110100"
        a(29) =  "11100110010"
        a(30) =  "11011011000"
        a(31) =  "11011000110"
        a(32) =  "11000110110"
        a(33) =  "10100011000"
        a(34) =  "10001011000"
        a(35) =  "10001000110"
        a(36) =  "10110001000"
        a(37) =  "10001101000"
        a(38) =  "10001100010"
        a(39) =  "11010001000"
        a(40) =  "11000101000"
        a(41) =  "11000100010"
        a(42) =  "10110111000"
        a(43) =  "10110001110"
        a(44) =  "10001101110"
        a(45) =  "10111011000"
        a(46) =  "10111000110"
        a(47) =  "10001110110"
        a(48) =  "11101110110"
        a(49) =  "11010001110"
        a(50) =  "11000101110"
        a(51) =  "11011101000"
        a(52) =  "11011100010"
        a(53) =  "11011101110"
        a(54) =  "11101011000"
        a(55) =  "11101000110"
        a(56) =  "11100010110"
        a(57) =  "11101101000"
        a(58) =  "11101100010"
        a(59) =  "11100011010"
        a(60) =  "11101111010"
        a(61) =  "11001000010"
        a(62) =  "11110001010"
        a(63) =  "10100110000"
        a(64) =  "10100001100"
        a(65) =  "10010110000"
        a(66) =  "10010000110"
        a(67) =  "10000101100"
        a(68) =  "10000100110"
        a(69) =  "10110010000"
        a(70) =  "10110000100"
        a(71) =  "10011010000"
        a(72) =  "10011000010"
        a(73) =  "10000110100"
        a(74) =  "10000110010"
        a(75) =  "11000010010"
        a(76) =  "11001010000"
        a(77) =  "11110111010"
        a(78) =  "11000010100"
        a(79) =  "10001111010"
        a(80) =  "10100111100"
        a(81) =  "10010111100"
        a(82) =  "10010011110"
        a(83) =  "10111100100"
        a(84) =  "10011110100"
        a(85) =  "10011110010"
        a(86) =  "11110100100"
        a(87) =  "11110010100"
        a(88) =  "11110010010"
        a(89) =  "11011011110"
        a(90) =  "11011110110"
        a(91) =  "11110110110"
        a(92) =  "10101111000"
        a(93) =  "10100011110"
        a(94) =  "10001011110"
        a(95) =  "10111101000"
        a(96) =  "10111100010"
        a(97) =  "11110101000"
        a(98) =  "11110100010"
        a(99) =  "10111011110"
        a(100) =  "10111101110"
        a(101) =  "11101011110"
        a(102) =  "11110101110"
        a(103) =  "11010000100"
        a(104) =  "11010010000"
        a(105) =  "11010011100"
        a(106) =  "1100011101011"

        ' check bit 값을 구하는 로직
        checksum = 0
        tot = 105 ' CODE-C 방식 , CHECK SUM 값을 위한 초기값으로 설정
        
        ' CODE-C 방식은 2자리씩 짤라서 해당 테이블 읽을 필요없이 그 숫자 자체를 계산해 주면 된다.    
        for ii = 1 to len(bar) / 2 
            tot = tot + ( mid(bar,ii*2-1,2) ) * ii
        next
        checksum = tot mod 103
        seq = a(checksum)
        result = a(105) ' CODE-C 방식
        
        ' 테이블에서 바코드 이미지를 읽어온다   CODE-C 방식은 2자리씩 짤라서 바로 테이블 자료 읽어오면 됨
        for ii = 1 to len(bar) / 2
            result = result & a(mid(bar,ii*2-1,2))
        next
        result = result & seq & a(106)

        getBarcode = ""
        getBarcode = getBarcode & "<div class=""barcodeBox"">"
        getBarcode = getBarcode & "    <table border=""0"" cellspacing=""0"" cellpadding=""0"">"
        getBarcode = getBarcode & "        <tr align=""center"">"
                    for ii = 1 to len(result)
        getBarcode = getBarcode & "                <td height=50 width=2 bgcolor="
                        if mid(result,ii,1) = 0 then 
        getBarcode = getBarcode & """#ffffff"" "
                        else  
        getBarcode = getBarcode & """#000000"" "
                        end if
        getBarcode = getBarcode & "> </td>"
                    next
                    
        getBarcode = getBarcode & "        </tr>"
        getBarcode = getBarcode & "    </table>  "
        getBarcode = getBarcode & "        <table border=""0"" cellspacing=""0"" cellpadding=""0"">"
        getBarcode = getBarcode & "        <tr>"
        getBarcode = getBarcode & "        <td align=center><font size=4><b>"&bar&"</td>"
        getBarcode = getBarcode & "        </tr>"
        getBarcode = getBarcode & "    </table>  "
        getBarcode = getBarcode & "</div>"

    end function
%>